unics - A (язык программирования)

Unix - B (язык программирования)

Unix - C (язык программирования)
безопастьность (доступ к файлам, доступ к памяти)
Многопользовательская, многозадачная.
На базе unix были созданы три операционки:

OpenBSD   FreeBSD     NetBSD
          (MacOS)
Если хотите понимать, как работают ОС, то книга "Современные операционные системы" автор Э.Таненбаун!
Линус Торвальдс вдохновился этой книгой и написал Linux (freers)
Выложил ее под лицензией GPL.

debian - операционная система.

kali linux - ОС для взлома!
tails - ОС для приватности (трафик невозможно отсследить)!

VirtualBox -скачать!
