unics - A (язык программирования)

Unix - B (язык программирования)

Unix - C (язык программирования)
безопастьность (доступ к файлам, доступ к памяти)
Многопользовательская, многозадачная.
На базе unix были созданы три операционки:

OpenBSD   FreeBSD     NetBSD
          (MacOS)
Если хотите понимать, как работают ОС, то книга "Современные операционные системы" автор Э.Таненбаун!
Линус Торвальдс вдохновился этой книгой и написал Linux (freers)
Выложил ее под лицензией GPL.

debian - операционная система.

kali linux - ОС для взлома!
tails - ОС для приватности (трафик невозможно отсследить)!

VirtualBox -скачать!

После установки проверяешь есть ли поддержка 64 бит.
Если не поддерживается 64 бит в virtualBox то гугли core i7 виртуализация
Заходишь в Биосс Intel Virtualization technology (Enabled)


Скачиваем rokylinux
index of /rokylinux/8/9/isos/x86_64/

Создаем VM

iso обораз - это (rokylinux/8/9/isos/x86_64/)

Пропустить автомат установку (поставить галочку)

4 гигов отдаем
2 процессора
жеский диск 80 гигов
Выделить место в полном размере (не ставить галочку)
Далее - Готово!
Настроить сеть (сетевой мост и мой вифи адаптер) ок
Носители (галка кеширование) хранить не кретичные данные так как используется оперативная память
Запускаем VM и устанавливаем rokylinux
Выбор программ (Рабочая станция)
- Приложение интернета и облочный проект



